Revit 2026 API

# ConnectorElementCreateCableTrayConnector(Document, Reference) Method

---

Create a new cable tray ConnectorElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ConnectorElement CreateCableTrayConnector(
	Document document,
	Reference planarFace
)
```
```vb
Public Shared Function CreateCableTrayConnector (
	document As Document,
	planarFace As Reference
) As ConnectorElement
```
```cpp
public:
static ConnectorElement^ CreateCableTrayConnector(
	Document^ document,
	Reference^ planarFace
)
```
```fsharp
static member CreateCableTrayConnector :
        document : Document *
        planarFace : Reference -> ConnectorElement
```

#### Parameters

document Document
     The document to add the connector to.
planarFace Reference
     The planar face to place the connector on.

#### Return Value

ConnectorElement The cable tray ConnectorElement.

| Exception | Condition |
| --- | --- |
| ArgumentException | The reference is not a planar face. -or- document is not a family document. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Connector creation is not allowed in this family. |

Regenerates the document.

#### Reference

ConnectorElement Class

CreateCableTrayConnector Overload

Autodesk.Revit.DB Namespace